## Task 1. Напишите по 3 примера использования map и filter на произвольных коллекциях - отпроцессируйте их элементы
# и отфильтруйте как вам угодно, для визуализации оберните результат в лист (6 баллов)

## Task 2. Напишите генератор, осуществляющий считывание фасты и возвращающий по 1-ой оттранслированной последовательности
# input, путь до фасты, таблица кодонов - 'Standard' по умолчанию, output, протеиновый Seq (12 баллов)


## Task 3. Сгенерируйте 52-карточную колоду (состоящую из кортежей типа (ранг, масть) с помощью приблуд из itertools -
# в вашем распоряжении iterable с рангами (2..10, J..A) и мастями (H, C, S, D) (10 баллов)


## Test 4. Сделайте функцию-генератор, генерирующую все ДНКовые последовательности до длины n
# (аккуратно, не вызывайте её с n > 8) list(generate(2))
['A', 'T', 'G', 'C', 'AA', 'AT', 'AG', 'AC', 'TA', 'TT', 'TG', 'TC',
'GA', 'GT', 'GG', 'GC', 'CA', 'CT', 'CG', 'CC'] (15 баллов)